; domain
(define (domain BLOCKS)
	(:requirements :strips :typing :equality)
	(:types block)
	(:constants )
	(:functions
		(total-cost )
	)
	(:predicates
		(split )
		(unsplit )
		(g0_done___ )
		(g1_done___ )
		(g2_done___ )
		(g0_achieved0 )
		(g1_achieved0 )
		(g2_achieved0 )
		(g0_achieved1 )
		(g1_achieved1 )
		(g2_achieved1 )
		(g0_achieved2 )
		(g1_achieved2 )
		(g2_achieved2 )
		(g0_on ?x1 - block ?x2 - block)
		(g1_on ?x1 - block ?x2 - block)
		(g2_on ?x1 - block ?x2 - block)
		(g0_ontable ?x1 - block)
		(g1_ontable ?x1 - block)
		(g2_ontable ?x1 - block)
		(g0_clear ?x1 - block)
		(g1_clear ?x1 - block)
		(g2_clear ?x1 - block)
		(g0_handempty )
		(g1_handempty )
		(g2_handempty )
		(g0_holding ?x1 - block)
		(g1_holding ?x1 - block)
		(g2_holding ?x1 - block)
		(g0_achieved0 )
		(g1_achieved0 )
		(g2_achieved0 )
		(g0_achieved1 )
		(g1_achieved1 )
		(g2_achieved1 )
		(g0_achieved2 )
		(g1_achieved2 )
		(g2_achieved2 )
	)
(:action do-split
	:parameters ()
	:precondition (and (unsplit ))
	:effect (and (not (unsplit )) (split ))
)
(:action mark-done-g0
	:parameters ()
	:precondition (and (split ) (g0_clear r) (g0_on r a) (g0_on a p) (g0_on p t) (g0_ontable t))
	:effect (and (g0_done___ ))
)
(:action mark-done-g1
	:parameters ()
	:precondition (and (split ) (g1_clear p) (g1_on p a) (g1_on a t) (g1_on t e) (g1_ontable e))
	:effect (and (g1_done___ ))
)
(:action mark-done-g2
	:parameters ()
	:precondition (and (split ) (g2_clear t) (g2_on t a) (g2_on a p) (g2_on p e) (g2_on e r) (g2_ontable r))
	:effect (and (g2_done___ ))
)
(:action gGLOBAL_pick-up
	:parameters (?x1 - block)
	:precondition (and (unsplit ) (g0_clear ?x1) (g1_clear ?x1) (g2_clear ?x1) (g0_ontable ?x1) (g1_ontable ?x1) (g2_ontable ?x1) (g0_handempty ) (g1_handempty ) (g2_handempty ))
	:effect (and (not (g0_achieved0 )) (not (g1_achieved0 )) (not (g2_achieved0 )) (not (g0_achieved1 )) (not (g1_achieved1 )) (not (g2_achieved1 )) (not (g0_achieved2 )) (not (g1_achieved2 )) (not (g2_achieved2 )) (not (g0_ontable ?x1)) (not (g1_ontable ?x1)) (not (g2_ontable ?x1)) (not (g0_clear ?x1)) (not (g1_clear ?x1)) (not (g2_clear ?x1)) (not (g0_handempty )) (not (g1_handempty )) (not (g2_handempty )) (g0_holding ?x1) (g1_holding ?x1) (g2_holding ?x1) (increase (total-cost ) 1))
)
(:action g0_pick-up
	:parameters (?x1 - block)
	:precondition (and (g0_clear ?x1) (g0_ontable ?x1) (g0_handempty ) (split ))
	:effect (and (not (g0_achieved0 )) (not (g0_achieved1 )) (not (g0_achieved2 )) (not (g0_ontable ?x1)) (not (g0_clear ?x1)) (not (g0_handempty )) (g0_holding ?x1) (increase (total-cost ) 112070.0))
)
(:action g1_pick-up
	:parameters (?x1 - block)
	:precondition (and (g1_clear ?x1) (g1_ontable ?x1) (g1_handempty ) (split ) (g0_done___ ))
	:effect (and (not (g1_achieved0 )) (not (g1_achieved1 )) (not (g1_achieved2 )) (not (g1_ontable ?x1)) (not (g1_clear ?x1)) (not (g1_handempty )) (g1_holding ?x1) (increase (total-cost ) 325106.0))
)
(:action g2_pick-up
	:parameters (?x1 - block)
	:precondition (and (g2_clear ?x1) (g2_ontable ?x1) (g2_handempty ) (split ) (g1_done___ ))
	:effect (and (not (g2_achieved0 )) (not (g2_achieved1 )) (not (g2_achieved2 )) (not (g2_ontable ?x1)) (not (g2_clear ?x1)) (not (g2_handempty )) (g2_holding ?x1) (increase (total-cost ) 88103.0))
)
(:action gGLOBAL_put-down
	:parameters (?x1 - block)
	:precondition (and (unsplit ) (g0_holding ?x1) (g1_holding ?x1) (g2_holding ?x1))
	:effect (and (not (g0_achieved0 )) (not (g1_achieved0 )) (not (g2_achieved0 )) (not (g0_achieved1 )) (not (g1_achieved1 )) (not (g2_achieved1 )) (not (g0_achieved2 )) (not (g1_achieved2 )) (not (g2_achieved2 )) (not (g0_holding ?x1)) (not (g1_holding ?x1)) (not (g2_holding ?x1)) (g0_clear ?x1) (g1_clear ?x1) (g2_clear ?x1) (g0_handempty ) (g1_handempty ) (g2_handempty ) (g0_ontable ?x1) (g1_ontable ?x1) (g2_ontable ?x1) (increase (total-cost ) 1))
)
(:action g0_put-down
	:parameters (?x1 - block)
	:precondition (and (g0_holding ?x1) (split ))
	:effect (and (not (g0_achieved0 )) (not (g0_achieved1 )) (not (g0_achieved2 )) (not (g0_holding ?x1)) (g0_clear ?x1) (g0_handempty ) (g0_ontable ?x1) (increase (total-cost ) 112070.0))
)
(:action g1_put-down
	:parameters (?x1 - block)
	:precondition (and (g1_holding ?x1) (split ) (g0_done___ ))
	:effect (and (not (g1_achieved0 )) (not (g1_achieved1 )) (not (g1_achieved2 )) (not (g1_holding ?x1)) (g1_clear ?x1) (g1_handempty ) (g1_ontable ?x1) (increase (total-cost ) 325106.0))
)
(:action g2_put-down
	:parameters (?x1 - block)
	:precondition (and (g2_holding ?x1) (split ) (g1_done___ ))
	:effect (and (not (g2_achieved0 )) (not (g2_achieved1 )) (not (g2_achieved2 )) (not (g2_holding ?x1)) (g2_clear ?x1) (g2_handempty ) (g2_ontable ?x1) (increase (total-cost ) 88103.0))
)
(:action gGLOBAL_stack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (unsplit ) (g0_holding ?x1) (g1_holding ?x1) (g2_holding ?x1) (g0_clear ?x2) (g1_clear ?x2) (g2_clear ?x2))
	:effect (and (not (g0_achieved0 )) (not (g1_achieved0 )) (not (g2_achieved0 )) (not (g0_achieved1 )) (not (g1_achieved1 )) (not (g2_achieved1 )) (not (g0_achieved2 )) (not (g1_achieved2 )) (not (g2_achieved2 )) (not (g0_holding ?x1)) (not (g1_holding ?x1)) (not (g2_holding ?x1)) (not (g0_clear ?x2)) (not (g1_clear ?x2)) (not (g2_clear ?x2)) (g0_clear ?x1) (g1_clear ?x1) (g2_clear ?x1) (g0_handempty ) (g1_handempty ) (g2_handempty ) (g0_on ?x1 ?x2) (g1_on ?x1 ?x2) (g2_on ?x1 ?x2) (increase (total-cost ) 1))
)
(:action g0_stack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (g0_holding ?x1) (g0_clear ?x2) (split ))
	:effect (and (not (g0_achieved0 )) (not (g0_achieved1 )) (not (g0_achieved2 )) (not (g0_holding ?x1)) (not (g0_clear ?x2)) (g0_clear ?x1) (g0_handempty ) (g0_on ?x1 ?x2) (increase (total-cost ) 112070.0))
)
(:action g1_stack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (g1_holding ?x1) (g1_clear ?x2) (split ) (g0_done___ ))
	:effect (and (not (g1_achieved0 )) (not (g1_achieved1 )) (not (g1_achieved2 )) (not (g1_holding ?x1)) (not (g1_clear ?x2)) (g1_clear ?x1) (g1_handempty ) (g1_on ?x1 ?x2) (increase (total-cost ) 325106.0))
)
(:action g2_stack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (g2_holding ?x1) (g2_clear ?x2) (split ) (g1_done___ ))
	:effect (and (not (g2_achieved0 )) (not (g2_achieved1 )) (not (g2_achieved2 )) (not (g2_holding ?x1)) (not (g2_clear ?x2)) (g2_clear ?x1) (g2_handempty ) (g2_on ?x1 ?x2) (increase (total-cost ) 88103.0))
)
(:action gGLOBAL_unstack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (unsplit ) (g0_on ?x1 ?x2) (g1_on ?x1 ?x2) (g2_on ?x1 ?x2) (g0_clear ?x1) (g1_clear ?x1) (g2_clear ?x1) (g0_handempty ) (g1_handempty ) (g2_handempty ))
	:effect (and (not (g0_achieved0 )) (not (g1_achieved0 )) (not (g2_achieved0 )) (not (g0_achieved1 )) (not (g1_achieved1 )) (not (g2_achieved1 )) (not (g0_achieved2 )) (not (g1_achieved2 )) (not (g2_achieved2 )) (g0_holding ?x1) (g1_holding ?x1) (g2_holding ?x1) (g0_clear ?x2) (g1_clear ?x2) (g2_clear ?x2) (not (g0_clear ?x1)) (not (g1_clear ?x1)) (not (g2_clear ?x1)) (not (g0_handempty )) (not (g1_handempty )) (not (g2_handempty )) (not (g0_on ?x1 ?x2)) (not (g1_on ?x1 ?x2)) (not (g2_on ?x1 ?x2)) (increase (total-cost ) 1))
)
(:action g0_unstack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (g0_on ?x1 ?x2) (g0_clear ?x1) (g0_handempty ) (split ))
	:effect (and (not (g0_achieved0 )) (not (g0_achieved1 )) (not (g0_achieved2 )) (g0_holding ?x1) (g0_clear ?x2) (not (g0_clear ?x1)) (not (g0_handempty )) (not (g0_on ?x1 ?x2)) (increase (total-cost ) 112070.0))
)
(:action g1_unstack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (g1_on ?x1 ?x2) (g1_clear ?x1) (g1_handempty ) (split ) (g0_done___ ))
	:effect (and (not (g1_achieved0 )) (not (g1_achieved1 )) (not (g1_achieved2 )) (g1_holding ?x1) (g1_clear ?x2) (not (g1_clear ?x1)) (not (g1_handempty )) (not (g1_on ?x1 ?x2)) (increase (total-cost ) 325106.0))
)
(:action g2_unstack
	:parameters (?x1 - block ?x2 - block)
	:precondition (and (g2_on ?x1 ?x2) (g2_clear ?x1) (g2_handempty ) (split ) (g1_done___ ))
	:effect (and (not (g2_achieved0 )) (not (g2_achieved1 )) (not (g2_achieved2 )) (g2_holding ?x1) (g2_clear ?x2) (not (g2_clear ?x1)) (not (g2_handempty )) (not (g2_on ?x1 ?x2)) (increase (total-cost ) 88103.0))
)
)

; problem
(define (problem p7)
	(:domain blocks)
	(:objects p - block a - block t - block e - block r - block)
	(:init 
		(unsplit )
		(g0_HANDEMPTY )
		(g1_HANDEMPTY )
		(g2_HANDEMPTY )
		(g0_ONTABLE p)
		(g1_ONTABLE p)
		(g2_ONTABLE p)
		(g0_CLEAR p)
		(g1_CLEAR p)
		(g2_CLEAR p)
		(g0_ONTABLE t)
		(g1_ONTABLE t)
		(g2_ONTABLE t)
		(g0_CLEAR a)
		(g1_CLEAR a)
		(g2_CLEAR a)
		(g0_ON a t)
		(g1_ON a t)
		(g2_ON a t)
		(g0_ONTABLE r)
		(g1_ONTABLE r)
		(g2_ONTABLE r)
		(g0_CLEAR e)
		(g1_CLEAR e)
		(g2_CLEAR e)
		(g0_ON e r)
		(g1_ON e r)
		(g2_ON e r)
		(= (total-cost ) 0.0)
	)
	(:goal (and (g0_clear r) (g0_on r a) (g0_on a p) (g0_on p t) (g0_ontable t) (g1_clear p) (g1_on p a) (g1_on a t) (g1_on t e) (g1_ontable e) (g2_clear t) (g2_on t a) (g2_on a p) (g2_on p e) (g2_on e r) (g2_ontable r)))
	(:metric minimize (total-cost ))
)

; plan
1. (gglobal_unstack e r)
   deleted: (g0_clear e) (g1_clear e) (g2_clear e) (g0_handempty) (g1_handempty) (g2_handempty) (g0_on e r) (g1_on e r) (g2_on e r)
   added: (g0_holding e) (g1_holding e) (g2_holding e) (g0_clear r) (g1_clear r) (g2_clear r)
   goals met: 5 of 16
2. (gglobal_put-down e)
   deleted: (g0_holding e) (g1_holding e) (g2_holding e)
   added: (g0_clear e) (g1_clear e) (g2_clear e) (g0_handempty) (g1_handempty) (g2_handempty) (g0_ontable e) (g1_ontable e) (g2_ontable e)
   goals met: 6 of 16
3. (gglobal_unstack a t)
   deleted: (g0_clear a) (g1_clear a) (g2_clear a) (g0_handempty) (g1_handempty) (g2_handempty) (g0_on a t) (g1_on a t) (g2_on a t)
   added: (g0_holding a) (g1_holding a) (g2_holding a) (g0_clear t) (g1_clear t) (g2_clear t)
   goals met: 6 of 16
4. (gglobal_stack a p)
   deleted: (g0_holding a) (g1_holding a) (g2_holding a) (g0_clear p) (g1_clear p) (g2_clear p)
   added: (g0_clear a) (g1_clear a) (g2_clear a) (g0_handempty) (g1_handempty) (g2_handempty) (g0_on a p) (g1_on a p) (g2_on a p)
   goals met: 7 of 16
5. (gglobal_pick-up t)
   deleted: (g0_ontable t) (g1_ontable t) (g2_ontable t) (g0_clear t) (g1_clear t) (g2_clear t) (g0_handempty) (g1_handempty) (g2_handempty)
   added: (g0_holding t) (g1_holding t) (g2_holding t)
   goals met: 5 of 16
6. (gglobal_stack t e)
   deleted: (g0_holding t) (g1_holding t) (g2_holding t) (g0_clear e) (g1_clear e) (g2_clear e)
   added: (g0_clear t) (g1_clear t) (g2_clear t) (g0_handempty) (g1_handempty) (g2_handempty) (g0_on t e) (g1_on t e) (g2_on t e)
   goals met: 7 of 16
7. (gglobal_unstack a p)
   deleted: (g0_clear a) (g1_clear a) (g2_clear a) (g0_handempty) (g1_handempty) (g2_handempty) (g0_on a p) (g1_on a p) (g2_on a p)
   added: (g0_holding a) (g1_holding a) (g2_holding a) (g0_clear p) (g1_clear p) (g2_clear p)
   goals met: 6 of 16
8. (gglobal_stack a t)
   deleted: (g0_holding a) (g1_holding a) (g2_holding a) (g0_clear t) (g1_clear t) (g2_clear t)
   added: (g0_clear a) (g1_clear a) (g2_clear a) (g0_handempty) (g1_handempty) (g2_handempty) (g0_on a t) (g1_on a t) (g2_on a t)
   goals met: 6 of 16
9. (gglobal_pick-up p)
   deleted: (g0_ontable p) (g1_ontable p) (g2_ontable p) (g0_clear p) (g1_clear p) (g2_clear p) (g0_handempty) (g1_handempty) (g2_handempty)
   added: (g0_holding p) (g1_holding p) (g2_holding p)
   goals met: 5 of 16
10. (gglobal_stack p a)
   deleted: (g0_holding p) (g1_holding p) (g2_holding p) (g0_clear a) (g1_clear a) (g2_clear a)
   added: (g0_clear p) (g1_clear p) (g2_clear p) (g0_handempty) (g1_handempty) (g2_handempty) (g0_on p a) (g1_on p a) (g2_on p a)
   goals met: 7 of 16
11. (do-split)
   deleted: (unsplit)
   added: (split)
   goals met: 7 of 16
12. (g0_unstack p a)
   deleted: (g0_clear p) (g0_handempty) (g0_on p a)
   added: (g0_holding p) (g0_clear a)
   goals met: 7 of 16
13. (g0_put-down p)
   deleted: (g0_holding p)
   added: (g0_clear p) (g0_handempty) (g0_ontable p)
   goals met: 7 of 16
14. (g0_unstack a t)
   deleted: (g0_clear a) (g0_handempty) (g0_on a t)
   added: (g0_holding a) (g0_clear t)
   goals met: 7 of 16
15. (g0_put-down a)
   deleted: (g0_holding a)
   added: (g0_clear a) (g0_handempty) (g0_ontable a)
   goals met: 7 of 16
16. (g0_unstack t e)
   deleted: (g0_clear t) (g0_handempty) (g0_on t e)
   added: (g0_holding t) (g0_clear e)
   goals met: 7 of 16
17. (g0_put-down t)
   deleted: (g0_holding t)
   added: (g0_clear t) (g0_handempty) (g0_ontable t)
   goals met: 8 of 16
18. (g0_pick-up p)
   deleted: (g0_ontable p) (g0_clear p) (g0_handempty)
   added: (g0_holding p)
   goals met: 8 of 16
19. (g0_stack p t)
   deleted: (g0_holding p) (g0_clear t)
   added: (g0_clear p) (g0_handempty) (g0_on p t)
   goals met: 9 of 16
20. (g0_pick-up a)
   deleted: (g0_ontable a) (g0_clear a) (g0_handempty)
   added: (g0_holding a)
   goals met: 9 of 16
21. (g0_stack a p)
   deleted: (g0_holding a) (g0_clear p)
   added: (g0_clear a) (g0_handempty) (g0_on a p)
   goals met: 10 of 16
22. (g0_pick-up r)
   deleted: (g0_ontable r) (g0_clear r) (g0_handempty)
   added: (g0_holding r)
   goals met: 9 of 16
23. (g0_stack r a)
   deleted: (g0_holding r) (g0_clear a)
   added: (g0_clear r) (g0_handempty) (g0_on r a)
   goals met: 11 of 16
24. (mark-done-g1)
   added: (g1_done___)
   goals met: 11 of 16
25. (g2_unstack p a)
   deleted: (g2_clear p) (g2_handempty) (g2_on p a)
   added: (g2_holding p) (g2_clear a)
   goals met: 11 of 16
26. (g2_put-down p)
   deleted: (g2_holding p)
   added: (g2_clear p) (g2_handempty) (g2_ontable p)
   goals met: 11 of 16
27. (g2_unstack a t)
   deleted: (g2_clear a) (g2_handempty) (g2_on a t)
   added: (g2_holding a) (g2_clear t)
   goals met: 12 of 16
28. (g2_put-down a)
   deleted: (g2_holding a)
   added: (g2_clear a) (g2_handempty) (g2_ontable a)
   goals met: 12 of 16
29. (g2_unstack t e)
   deleted: (g2_clear t) (g2_handempty) (g2_on t e)
   added: (g2_holding t) (g2_clear e)
   goals met: 11 of 16
30. (g2_put-down t)
   deleted: (g2_holding t)
   added: (g2_clear t) (g2_handempty) (g2_ontable t)
   goals met: 12 of 16
31. (g2_pick-up e)
   deleted: (g2_ontable e) (g2_clear e) (g2_handempty)
   added: (g2_holding e)
   goals met: 12 of 16
32. (g2_stack e r)
   deleted: (g2_holding e) (g2_clear r)
   added: (g2_clear e) (g2_handempty) (g2_on e r)
   goals met: 13 of 16
33. (g2_pick-up p)
   deleted: (g2_ontable p) (g2_clear p) (g2_handempty)
   added: (g2_holding p)
   goals met: 13 of 16
34. (g2_stack p e)
   deleted: (g2_holding p) (g2_clear e)
   added: (g2_clear p) (g2_handempty) (g2_on p e)
   goals met: 14 of 16
35. (g2_pick-up a)
   deleted: (g2_ontable a) (g2_clear a) (g2_handempty)
   added: (g2_holding a)
   goals met: 14 of 16
36. (g2_stack a p)
   deleted: (g2_holding a) (g2_clear p)
   added: (g2_clear a) (g2_handempty) (g2_on a p)
   goals met: 15 of 16
37. (g2_pick-up t)
   deleted: (g2_ontable t) (g2_clear t) (g2_handempty)
   added: (g2_holding t)
   goals met: 14 of 16
38. (g2_stack t a)
   deleted: (g2_holding t) (g2_clear a)
   added: (g2_clear t) (g2_handempty) (g2_on t a)
   goals met: 16 of 16
